# 1. Напишите программу, которая принимает на вход два числа и проверяет является ли одно число квадратом другого.
# *Примеры:*
# -5, 25 -> да
# -4, 16 -> да
# -25, 5 -> да
# -8, 9 -> нет

num1, num2 = int(input()), int(input())
if num1 ** 2 = num2 or num2 ** == num1:
    print('да')
else:
    print('нет')













# 2. Напишите программу, которая на вход принмает 5 чисел и находит максимальное из них.
# Примеры:
# -1,4,8,7,5 -> 8
# -78,55,36,90,2 -> 90