# ============================= Задача №1 =============================
# Реализуйте алгоритм задания случайных чисел без
# использования встроенного генератора псевдослучайных чисел.

# num = float(input("Введите "))

# ============================= Задача №2 ============================= 
# Задайте список. Напишите программу, которая определит, 
# присутсвует ли в заданном списке некое число.

# list1 = ["2","43","5","331","91","35","79","53",]
# x = input("Введите число: ")

# for i in list:
#     if x == i:
#         print("Заданное число присутсвует в списке")
#         break
# else:
#     print("Заданное чисило отсутсвует в списке")

# ============================= Задача №3 ============================= 
# Напишите программу, которая определит позицию второго вхождения
# строки в списке либо сообщит, что ее нет.

# my_list = ["123", "234", "123", "567"]
# print(my_list)

# string_find = "123"
# count = 0
# for i in range(len(my_list)):
#     if string_find == my_list[i]:
#         count += 1
#         if count == 2:
#             print(i)
#             break
# else:
#     print(-1)

# ============================= Задача №4 ============================= 